app/User.php

    public function siblings()
    {
        if (is_null($this->father_id) && is_null($this->mother_id) && is_null($this->parent_id)) {
            return collect([]);
        }

        return User::where('id', '!=', $this->id)
            ->where(function ($query) {
                if (!is_null($this->father_id)) {
                    $query->where('father_id', $this->father_id);
                }

                if (!is_null($this->mother_id)) {
                    $query->orWhere('mother_id', $this->mother_id);
                }

                if (!is_null($this->parent_id)) {
                    $query->orWhere('parent_id', $this->parent_id);
                }

            })
            ->orderBy('birth_order')->get();
---
select * from `users` where `id` != 'aaee9287-c8b1-4c66-badd-67fb3ae586a6' and (`father_id` = 'afa61c36-de82-437c-adfe-9539e05a9d8d' or `mother_id` = '78a1021b-3318-4cbf-b828-4e47225ea659' or `parent_id` = 'eb08c6a6-6012-4cea-a186-0edac7e2c82f') order by `birth_order` asc

    public function getMetadata($key = null, $defaultValue = null)
    {
        $metadata = $this->metadata;

        if (is_null($key)) {
            $metadataCollection = [];
            foreach ($metadata as $metaKey => $metaValue) {
                $metadataCollection[$metaKey] = $metaValue;
            }

            return collect($metadataCollection);
        }

        $meta = $metadata->filter(function ($meta) use ($key) {
            return $meta->key == $key;
        })->first();
---
select * from `user_metadata` where `user_metadata`.`user_id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6' and `user_metadata`.`user_id` is not null