app/Http/Controllers/HomeController.php

    public function index()
    {
        $user = auth()->user();

        $usersMariageList = [];
        foreach ($user->couples as $spouse) {
            $usersMariageList[$spouse->pivot->id] = $user->name.' & '.$spouse->name;
        }

        $malePersonList = User::where('gender_id', 1)->pluck('nickname', 'id');
---
select `nickname`, `id` from `users` where `gender_id` = 2