app/Http/Controllers/MemoryController.php

select * from `memories` order by `created_at` desc
---
    public function AllMemory(){
        $memories = Memory::latest()->get();

select * from `users` where `users`.`id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6' limit 1
select * from `memories` where `user_id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6'
---
    public function ViewMemory($user){
        $users = User::findOrFail($user);
        $memories = Memory::where('user_id', $user)->get();

select * from `users` where `users`.`id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6' limit 1
---
    public function AddMemory($id){
        $user = User::findOrFail($id);

select * from `memories` where `memories`.`id` = '7' limit 1
---
    public function EditMemory($id){
        $memories = Memory::findOrFail($id);

select * from `memories` where `memories`.`id` is null limit 1
---
    public function UpdateMemory(MemoryRequest $request){
        $validated = $request->validated();
        $memory_id = $request->id;
        Memory::findOrFail($memory_id)->update($request->post());