app/Http/Controllers/ProjectController.php

select * from `users` where `users`.`id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6' limit 1
select * from `projects` where `user_id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6'
---
    public function ViewCompany($user){
        $users = User::findOrFail($user);
        $projects = Project::where('user_id', $user)->get();

select * from `users` where `users`.`id` = 'aaee9287-c8b1-4c66-badd-67fb3ae586a6' limit 1
---
    public function AddCompany($id){
        $users = User::findOrFail($id);

insert into `projects` (`user_id`, `company_name`, `company_address`, `company_image`) values ('aaee9287-c8b1-4c66-badd-67fb3ae586a6', 'wv', 'wvwev', 'upload/company_image/1768754213318227.jpg')
---
    public function StoreCompany(ProjectRequest $request){
        $validated = $request->validated();
        if ($image = $request->file('company_image')) {
            $destinationPath = 'company_image/';
            $profileImage = hexdec(uniqid()).'.'.$image->getClientOriginalExtension();
            $image->move($destinationPath, $profileImage);


            $input = $profileImage;

            $postData = ['user_id' => $request->user_id,
            'company_phone' => $request->company_phone,
            'company_facebook' => $request->company_facebook,
            'company_twitter' => $request->company_twitter,
            'company_instagram' => $request->company_instagram,
            'company_links' => $request->company_links,
            'company_name' => $request->company_name,
            'company_address' => $request->company_address,
            'company_image' => $input];
                    Project::insert($postData);

select * from `projects` where `projects`.`id` = '23' limit 1
---
    public function EditCompany($id){
        $project = Project::findOrFail($id);

select * from `projects` where `projects`.`id` = '22' limit 1
update `projects` set `company_image` = '20230615162127.jpg', `projects`.`updated_at` = '2023-06-15 16:21:27' where `id` = 22
---
    public function UpdateCompany(ProjectRequest $request){
        $validated = $request->validated();
        $project_id = $request->id;

        if ($image = $request->file('company_image')) {
            $destinationPath = 'company_image/';
            $profileImage = date('YmdHis') . "." . $image->getClientOriginalExtension();
            $image->move($destinationPath, $profileImage);
            $input = "$profileImage";
        }else{
            unset($input['company_image']);
        }
        $postData = [
        'user_id' => $request->user_id,
        'company_phone' => $request->company_phone,
        'company_facebook' => $request->company_facebook,
        'company_twitter' => $request->company_twitter,
        'company_instagram' => $request->company_instagram,
        'company_links' => $request->company_links,
        'company_name' => $request->company_name,
        'company_address' => $request->company_address,
        'company_image' => $input
    ];

        Project::findOrFail($project_id)->update($postData);

select * from `projects` where `projects`.`id` = '23' limit 1
---
    public function DeleteCompany($id){
        Project::findOrFail($id)->delete();