app/Http/Controllers/UsersController.php

select * from `users` where `role` = 'admin'
---
    public function search(Request $request)
    {
        $userss = User::where('role', "admin")->get();

select * from `users`
---
    public function tree(User $user)
    {
        $users = User::all();

update `users` set `email` = 'eververer@gmail.com', `password` = '$2y$10$oi9XxQ6nWw3XUIS4Nqiv9OdF.bk/wM.rY2V0evVwkONHv1PS..ECS', `users`.`updated_at` = '2023-06-15 17:50:11' where `id` = '78a1021b-3318-4cbf-b828-4e47225ea659'
---
    public function update(UpdateRequest $request, User $user)
    {
        $userAttributes = $request->validated();
        $user->update($userAttributes);

select `nickname`, `id` from `users` where `gender_id` = 1
---
    private function getPersonList(int $genderId)
    {
        return User::where('gender_id', $genderId)->pluck('nickname', 'id');

select * from `couples`
---
    private function getAllMariageList()
    {
        $allMariageList = [];

        foreach (Couple::with('husband', 'wife')->get() as $couple) {